# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info on Unique Values

In [4]:
#getting the information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [53]:
#getting the unique values

array([444, 555, 666])

In [54]:
#getting the count of unique values

3

In [55]:
#getting the count of every unique values

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecting Data

In [3]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [6]:
#Select from DataFrame using criteria from multiple columns

In [7]:
newdf

   col1  col2 col3
3     4   444  xyz

### Applying Functions

In [14]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [17]:
df

   col1  col2 col3
0     2   444  abc
1     4   555  def
2     6   666  ghi
3     8   444  xyz

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

20

** Get column and index names: **

Index(['col2', 'col3'], dtype='object')

RangeIndex(start=0, stop=4, step=1)

** Sorting and Ordering a DataFrame:**

# Great Job!